flow_wave_1_meter_run3_cleaned/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10.0                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    
    inlet
    {
        type            zeroGradient;
    }
    
    
//    "(top|inlet|side)"
    "(top|side|axis)"
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }

}



// ************************************************************************* //
